examples_wave_flume/mesh_convergence_study/case4_irregular/4CPH/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "caseSetup"

scale   1;

vertices
(
    ( 0    -$s2 $sB)
    ( $s1  -$s2 $sB)
    ( $s1   $s2 $sB)
    ( 0     $s2 $sB)

    ( 0    -$s2 -$sRefine)
    ( $s1  -$s2 -$sRefine)
    ( $s1   $s2 -$sRefine)
    ( 0     $s2 -$sRefine)

    ( 0     -$s2  0.0)
    ( $s1   -$s2  0.0)
    ( $s1    $s2  0.0)
    ( 0      $s2  0.0)

    ( 0     -$s2  $sRefine)
    ( $s1   -$s2  $sRefine)
    ( $s1    $s2  $sRefine)
    ( 0      $s2  $sRefine)

    ( 0     -$s2  $sA)
    ( $s1   -$s2  $sA)
    ( $s1    $s2  $sA)
    ( 0      $s2  $sA)
);

blocks
(
    hex ( 0  1  2  3  4  5  6  7) ($xCells $yCells $zCells_A) simpleGrading (1 1 $zGradingB)  // block from zmin to start of refinement level
    hex ( 4  5  6  7  8  9 10 11) ($xCells $yCells $zCells_ref) simpleGrading (1 1 1)      	// start of refinement level to water surface
    hex ( 8  9 10 11 12 13 14 15) ($xCells $yCells $zCells_ref) simpleGrading (1 1 1)          	// water surface to end of refinement level
    hex (12 13 14 15 16 17 18 19) ($xCells $yCells $zCells_B) simpleGrading (1 1 $zGradingA)    // refinement leve out to top
);

edges
(
);

boundary
(
    atmosphere
    {
        type patch;
        faces
        (
            (16 17 18 19)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
            (5 6 10 9)
            (9 10 14 13)
            (13 14 18 17)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
            (4 8 11 7)
            (8 12 15 11)
            (12 16 19 15)
        );
    }
    bottom
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    leftSide
    {
        type symmetryPlane;
        faces
        (
            (0 1 5 4)
            (4 5 9 8)
            (8 9 13 12)
            (12 13 17 16)
        );
    }
    rightSide
    {
        type symmetryPlane;
        faces
        (
            (3 7 6 2)
            (7 11 10 6)
            (11 15 14 10)
            (15 19 18 14)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
