examples_wave_flume/mesh_convergence_study/case4_irregular/4CPH/constant/waveInput.txt
waveHeights
1
...
wavePeriods
1
...
wavePhases
1
...
waveAngles
1
...
waveDirs
1
...
